app/controllers/songs_controller.rb

  def upload
    # binding.pry
    CSV.foreach(params[:file].path, headers: true) do |x|
      # binding.pry
      Song.create(title: x[0], artist_name: x[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-01 21:36:09.438931"], ["updated_at", "2018-10-01 21:36:09.438931"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-10-01 21:36:09.453687"], ["updated_at", "2018-10-01 21:36:09.453687"]]